###############################################################
#  Generated by:      gen_sdc.py
#  Generated on:      Mon Jul 21 15:22:03 2025
#  Design:            s510
###############################################################
current_design s510
create_clock [get_ports {CK}] -name CK -period 260.0 -waveform {0.0 130.0}
set_input_transition -min 2.6  [get_ports {CK}]
set_input_transition -max 13  [get_ports {CK}]
set_input_transition -min 2.6  [get_ports {GND}]
set_input_transition -max 13  [get_ports {GND}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {GND}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {GND}]
set_input_transition -min 2.6  [get_ports {VDD}]
set_input_transition -max 13  [get_ports {VDD}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {VDD}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {VDD}]
set_input_transition -min 2.6  [get_ports {cnt10}]
set_input_transition -max 13  [get_ports {cnt10}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cnt10}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cnt10}]
set_input_transition -min 2.6  [get_ports {cnt13}]
set_input_transition -max 13  [get_ports {cnt13}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cnt13}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cnt13}]
set_input_transition -min 2.6  [get_ports {cnt21}]
set_input_transition -max 13  [get_ports {cnt21}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cnt21}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cnt21}]
set_input_transition -min 2.6  [get_ports {cnt261}]
set_input_transition -max 13  [get_ports {cnt261}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cnt261}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cnt261}]
set_input_transition -min 2.6  [get_ports {cnt272}]
set_input_transition -max 13  [get_ports {cnt272}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cnt272}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cnt272}]
set_input_transition -min 2.6  [get_ports {cnt283}]
set_input_transition -max 13  [get_ports {cnt283}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cnt283}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cnt283}]
set_input_transition -min 2.6  [get_ports {cnt284}]
set_input_transition -max 13  [get_ports {cnt284}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cnt284}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cnt284}]
set_input_transition -min 2.6  [get_ports {cnt44}]
set_input_transition -max 13  [get_ports {cnt44}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cnt44}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cnt44}]
set_input_transition -min 2.6  [get_ports {cnt45}]
set_input_transition -max 13  [get_ports {cnt45}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cnt45}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cnt45}]
set_input_transition -min 2.6  [get_ports {cnt509}]
set_input_transition -max 13  [get_ports {cnt509}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cnt509}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cnt509}]
set_input_transition -min 2.6  [get_ports {cnt511}]
set_input_transition -max 13  [get_ports {cnt511}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cnt511}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cnt511}]
set_input_transition -min 2.6  [get_ports {cnt567}]
set_input_transition -max 13  [get_ports {cnt567}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cnt567}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cnt567}]
set_input_transition -min 2.6  [get_ports {cnt591}]
set_input_transition -max 13  [get_ports {cnt591}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cnt591}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cnt591}]
set_input_transition -min 2.6  [get_ports {john}]
set_input_transition -max 13  [get_ports {john}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {john}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {john}]
set_input_transition -min 2.6  [get_ports {pcnt12}]
set_input_transition -max 13  [get_ports {pcnt12}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {pcnt12}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {pcnt12}]
set_input_transition -min 2.6  [get_ports {pcnt17}]
set_input_transition -max 13  [get_ports {pcnt17}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {pcnt17}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {pcnt17}]
set_input_transition -min 2.6  [get_ports {pcnt241}]
set_input_transition -max 13  [get_ports {pcnt241}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {pcnt241}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {pcnt241}]
set_input_transition -min 2.6  [get_ports {pcnt27}]
set_input_transition -max 13  [get_ports {pcnt27}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {pcnt27}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {pcnt27}]
set_input_transition -min 2.6  [get_ports {pcnt6}]
set_input_transition -max 13  [get_ports {pcnt6}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {pcnt6}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {pcnt6}]
set_max_transition 2.6  [get_ports {cblank}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cblank}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cblank}]
set_max_transition 2.6  [get_ports {cclr}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {cclr}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {cclr}]
set_max_transition 2.6  [get_ports {csm}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {csm}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {csm}]
set_max_transition 2.6  [get_ports {csync}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {csync}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {csync}]
set_max_transition 2.6  [get_ports {pc}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {pc}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {pc}]
set_max_transition 2.6  [get_ports {pclr}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {pclr}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {pclr}]
set_max_transition 2.6  [get_ports {vsync}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {vsync}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {vsync}]
