###############################################################
#  Generated by:      gen_sdc.py
#  Generated on:      Mon Jul 21 15:21:48 2025
#  Design:            s420
###############################################################
current_design s420
create_clock [get_ports {CK}] -name CK -period 260.0 -waveform {0.0 130.0}
set_input_transition -min 2.6  [get_ports {CK}]
set_input_transition -max 13  [get_ports {CK}]
set_input_transition -min 2.6  [get_ports {C_0}]
set_input_transition -max 13  [get_ports {C_0}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_0}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_0}]
set_input_transition -min 2.6  [get_ports {C_1}]
set_input_transition -max 13  [get_ports {C_1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_1}]
set_input_transition -min 2.6  [get_ports {C_10}]
set_input_transition -max 13  [get_ports {C_10}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_10}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_10}]
set_input_transition -min 2.6  [get_ports {C_11}]
set_input_transition -max 13  [get_ports {C_11}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_11}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_11}]
set_input_transition -min 2.6  [get_ports {C_12}]
set_input_transition -max 13  [get_ports {C_12}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_12}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_12}]
set_input_transition -min 2.6  [get_ports {C_13}]
set_input_transition -max 13  [get_ports {C_13}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_13}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_13}]
set_input_transition -min 2.6  [get_ports {C_14}]
set_input_transition -max 13  [get_ports {C_14}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_14}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_14}]
set_input_transition -min 2.6  [get_ports {C_15}]
set_input_transition -max 13  [get_ports {C_15}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_15}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_15}]
set_input_transition -min 2.6  [get_ports {C_16}]
set_input_transition -max 13  [get_ports {C_16}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_16}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_16}]
set_input_transition -min 2.6  [get_ports {C_2}]
set_input_transition -max 13  [get_ports {C_2}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_2}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_2}]
set_input_transition -min 2.6  [get_ports {C_3}]
set_input_transition -max 13  [get_ports {C_3}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_3}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_3}]
set_input_transition -min 2.6  [get_ports {C_4}]
set_input_transition -max 13  [get_ports {C_4}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_4}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_4}]
set_input_transition -min 2.6  [get_ports {C_5}]
set_input_transition -max 13  [get_ports {C_5}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_5}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_5}]
set_input_transition -min 2.6  [get_ports {C_6}]
set_input_transition -max 13  [get_ports {C_6}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_6}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_6}]
set_input_transition -min 2.6  [get_ports {C_7}]
set_input_transition -max 13  [get_ports {C_7}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_7}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_7}]
set_input_transition -min 2.6  [get_ports {C_8}]
set_input_transition -max 13  [get_ports {C_8}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_8}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_8}]
set_input_transition -min 2.6  [get_ports {C_9}]
set_input_transition -max 13  [get_ports {C_9}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_9}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_9}]
set_input_transition -min 2.6  [get_ports {GND}]
set_input_transition -max 13  [get_ports {GND}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {GND}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {GND}]
set_input_transition -min 2.6  [get_ports {P_0}]
set_input_transition -max 13  [get_ports {P_0}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {P_0}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {P_0}]
set_input_transition -min 2.6  [get_ports {VDD}]
set_input_transition -max 13  [get_ports {VDD}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {VDD}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {VDD}]
set_max_transition 2.6  [get_ports {Z}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {Z}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {Z}]
