###############################################################
#  Generated by:      gen_sdc.py
#  Generated on:      Mon Jul 21 15:22:50 2025
#  Design:            s838
###############################################################
current_design s838
create_clock [get_ports {CK}] -name CK -period 260.0 -waveform {0.0 130.0}
set_input_transition -min 2.6  [get_ports {CK}]
set_input_transition -max 13  [get_ports {CK}]
set_input_transition -min 2.6  [get_ports {C_0}]
set_input_transition -max 13  [get_ports {C_0}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_0}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_0}]
set_input_transition -min 2.6  [get_ports {C_1}]
set_input_transition -max 13  [get_ports {C_1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_1}]
set_input_transition -min 2.6  [get_ports {C_10}]
set_input_transition -max 13  [get_ports {C_10}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_10}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_10}]
set_input_transition -min 2.6  [get_ports {C_11}]
set_input_transition -max 13  [get_ports {C_11}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_11}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_11}]
set_input_transition -min 2.6  [get_ports {C_12}]
set_input_transition -max 13  [get_ports {C_12}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_12}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_12}]
set_input_transition -min 2.6  [get_ports {C_13}]
set_input_transition -max 13  [get_ports {C_13}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_13}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_13}]
set_input_transition -min 2.6  [get_ports {C_14}]
set_input_transition -max 13  [get_ports {C_14}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_14}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_14}]
set_input_transition -min 2.6  [get_ports {C_15}]
set_input_transition -max 13  [get_ports {C_15}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_15}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_15}]
set_input_transition -min 2.6  [get_ports {C_16}]
set_input_transition -max 13  [get_ports {C_16}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_16}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_16}]
set_input_transition -min 2.6  [get_ports {C_17}]
set_input_transition -max 13  [get_ports {C_17}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_17}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_17}]
set_input_transition -min 2.6  [get_ports {C_18}]
set_input_transition -max 13  [get_ports {C_18}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_18}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_18}]
set_input_transition -min 2.6  [get_ports {C_19}]
set_input_transition -max 13  [get_ports {C_19}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_19}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_19}]
set_input_transition -min 2.6  [get_ports {C_2}]
set_input_transition -max 13  [get_ports {C_2}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_2}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_2}]
set_input_transition -min 2.6  [get_ports {C_20}]
set_input_transition -max 13  [get_ports {C_20}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_20}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_20}]
set_input_transition -min 2.6  [get_ports {C_21}]
set_input_transition -max 13  [get_ports {C_21}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_21}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_21}]
set_input_transition -min 2.6  [get_ports {C_22}]
set_input_transition -max 13  [get_ports {C_22}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_22}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_22}]
set_input_transition -min 2.6  [get_ports {C_23}]
set_input_transition -max 13  [get_ports {C_23}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_23}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_23}]
set_input_transition -min 2.6  [get_ports {C_24}]
set_input_transition -max 13  [get_ports {C_24}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_24}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_24}]
set_input_transition -min 2.6  [get_ports {C_25}]
set_input_transition -max 13  [get_ports {C_25}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_25}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_25}]
set_input_transition -min 2.6  [get_ports {C_26}]
set_input_transition -max 13  [get_ports {C_26}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_26}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_26}]
set_input_transition -min 2.6  [get_ports {C_27}]
set_input_transition -max 13  [get_ports {C_27}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_27}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_27}]
set_input_transition -min 2.6  [get_ports {C_28}]
set_input_transition -max 13  [get_ports {C_28}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_28}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_28}]
set_input_transition -min 2.6  [get_ports {C_29}]
set_input_transition -max 13  [get_ports {C_29}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_29}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_29}]
set_input_transition -min 2.6  [get_ports {C_3}]
set_input_transition -max 13  [get_ports {C_3}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_3}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_3}]
set_input_transition -min 2.6  [get_ports {C_30}]
set_input_transition -max 13  [get_ports {C_30}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_30}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_30}]
set_input_transition -min 2.6  [get_ports {C_31}]
set_input_transition -max 13  [get_ports {C_31}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_31}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_31}]
set_input_transition -min 2.6  [get_ports {C_32}]
set_input_transition -max 13  [get_ports {C_32}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_32}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_32}]
set_input_transition -min 2.6  [get_ports {C_4}]
set_input_transition -max 13  [get_ports {C_4}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_4}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_4}]
set_input_transition -min 2.6  [get_ports {C_5}]
set_input_transition -max 13  [get_ports {C_5}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_5}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_5}]
set_input_transition -min 2.6  [get_ports {C_6}]
set_input_transition -max 13  [get_ports {C_6}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_6}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_6}]
set_input_transition -min 2.6  [get_ports {C_7}]
set_input_transition -max 13  [get_ports {C_7}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_7}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_7}]
set_input_transition -min 2.6  [get_ports {C_8}]
set_input_transition -max 13  [get_ports {C_8}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_8}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_8}]
set_input_transition -min 2.6  [get_ports {C_9}]
set_input_transition -max 13  [get_ports {C_9}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {C_9}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {C_9}]
set_input_transition -min 2.6  [get_ports {GND}]
set_input_transition -max 13  [get_ports {GND}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {GND}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {GND}]
set_input_transition -min 2.6  [get_ports {P_0}]
set_input_transition -max 13  [get_ports {P_0}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {P_0}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {P_0}]
set_input_transition -min 2.6  [get_ports {VDD}]
set_input_transition -max 13  [get_ports {VDD}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {VDD}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {VDD}]
set_max_transition 2.6  [get_ports {Z}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {Z}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {Z}]
