###############################################################
#  Generated by:      gen_sdc.py
#  Generated on:      Mon Jul 21 15:23:42 2025
#  Design:            s1488
###############################################################
current_design s1488
create_clock [get_ports {CK}] -name CK -period 260.0 -waveform {0.0 130.0}
set_input_transition -min 2.6  [get_ports {CK}]
set_input_transition -max 13  [get_ports {CK}]
set_input_transition -min 2.6  [get_ports {CLR}]
set_input_transition -max 13  [get_ports {CLR}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {CLR}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {CLR}]
set_input_transition -min 2.6  [get_ports {GND}]
set_input_transition -max 13  [get_ports {GND}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {GND}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {GND}]
set_input_transition -min 2.6  [get_ports {VDD}]
set_input_transition -max 13  [get_ports {VDD}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {VDD}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {VDD}]
set_input_transition -min 2.6  [get_ports {v0}]
set_input_transition -max 13  [get_ports {v0}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v0}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v0}]
set_input_transition -min 2.6  [get_ports {v1}]
set_input_transition -max 13  [get_ports {v1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v1}]
set_input_transition -min 2.6  [get_ports {v2}]
set_input_transition -max 13  [get_ports {v2}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v2}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v2}]
set_input_transition -min 2.6  [get_ports {v3}]
set_input_transition -max 13  [get_ports {v3}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v3}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v3}]
set_input_transition -min 2.6  [get_ports {v4}]
set_input_transition -max 13  [get_ports {v4}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v4}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v4}]
set_input_transition -min 2.6  [get_ports {v5}]
set_input_transition -max 13  [get_ports {v5}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v5}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v5}]
set_input_transition -min 2.6  [get_ports {v6}]
set_input_transition -max 13  [get_ports {v6}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v6}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v6}]
set_max_transition 2.6  [get_ports {v13_D_10}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_10}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_10}]
set_max_transition 2.6  [get_ports {v13_D_11}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_11}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_11}]
set_max_transition 2.6  [get_ports {v13_D_12}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_12}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_12}]
set_max_transition 2.6  [get_ports {v13_D_13}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_13}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_13}]
set_max_transition 2.6  [get_ports {v13_D_14}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_14}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_14}]
set_max_transition 2.6  [get_ports {v13_D_15}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_15}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_15}]
set_max_transition 2.6  [get_ports {v13_D_16}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_16}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_16}]
set_max_transition 2.6  [get_ports {v13_D_17}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_17}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_17}]
set_max_transition 2.6  [get_ports {v13_D_18}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_18}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_18}]
set_max_transition 2.6  [get_ports {v13_D_19}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_19}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_19}]
set_max_transition 2.6  [get_ports {v13_D_20}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_20}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_20}]
set_max_transition 2.6  [get_ports {v13_D_21}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_21}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_21}]
set_max_transition 2.6  [get_ports {v13_D_22}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_22}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_22}]
set_max_transition 2.6  [get_ports {v13_D_23}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_23}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_23}]
set_max_transition 2.6  [get_ports {v13_D_24}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_24}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_24}]
set_max_transition 2.6  [get_ports {v13_D_6}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_6}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_6}]
set_max_transition 2.6  [get_ports {v13_D_7}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_7}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_7}]
set_max_transition 2.6  [get_ports {v13_D_8}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_8}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_8}]
set_max_transition 2.6  [get_ports {v13_D_9}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {v13_D_9}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {v13_D_9}]
