###############################################################
#  Generated by:      gen_sdc.py
#  Generated on:      Mon Jul 21 15:21:19 2025
#  Design:            s344
###############################################################
current_design s344
create_clock [get_ports {CK}] -name CK -period 260.0 -waveform {0.0 130.0}
set_input_transition -min 2.6  [get_ports {CK}]
set_input_transition -max 13  [get_ports {CK}]
set_input_transition -min 2.6  [get_ports {A0}]
set_input_transition -max 13  [get_ports {A0}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {A0}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {A0}]
set_input_transition -min 2.6  [get_ports {A1}]
set_input_transition -max 13  [get_ports {A1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {A1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {A1}]
set_input_transition -min 2.6  [get_ports {A2}]
set_input_transition -max 13  [get_ports {A2}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {A2}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {A2}]
set_input_transition -min 2.6  [get_ports {A3}]
set_input_transition -max 13  [get_ports {A3}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {A3}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {A3}]
set_input_transition -min 2.6  [get_ports {B0}]
set_input_transition -max 13  [get_ports {B0}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {B0}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {B0}]
set_input_transition -min 2.6  [get_ports {B1}]
set_input_transition -max 13  [get_ports {B1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {B1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {B1}]
set_input_transition -min 2.6  [get_ports {B2}]
set_input_transition -max 13  [get_ports {B2}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {B2}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {B2}]
set_input_transition -min 2.6  [get_ports {B3}]
set_input_transition -max 13  [get_ports {B3}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {B3}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {B3}]
set_input_transition -min 2.6  [get_ports {GND}]
set_input_transition -max 13  [get_ports {GND}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {GND}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {GND}]
set_input_transition -min 2.6  [get_ports {START}]
set_input_transition -max 13  [get_ports {START}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {START}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {START}]
set_input_transition -min 2.6  [get_ports {VDD}]
set_input_transition -max 13  [get_ports {VDD}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {VDD}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {VDD}]
set_max_transition 2.6  [get_ports {CNTVCO2}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {CNTVCO2}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {CNTVCO2}]
set_max_transition 2.6  [get_ports {CNTVCON2}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {CNTVCON2}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {CNTVCON2}]
set_max_transition 2.6  [get_ports {P0}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {P0}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {P0}]
set_max_transition 2.6  [get_ports {P1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {P1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {P1}]
set_max_transition 2.6  [get_ports {P2}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {P2}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {P2}]
set_max_transition 2.6  [get_ports {P3}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {P3}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {P3}]
set_max_transition 2.6  [get_ports {P4}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {P4}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {P4}]
set_max_transition 2.6  [get_ports {P5}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {P5}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {P5}]
set_max_transition 2.6  [get_ports {P6}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {P6}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {P6}]
set_max_transition 2.6  [get_ports {P7}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {P7}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {P7}]
set_max_transition 2.6  [get_ports {READY}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {READY}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {READY}]
