###############################################################
#  Generated by:      gen_sdc.py
#  Generated on:      Mon Jul 21 15:22:11 2025
#  Design:            s526
###############################################################
current_design s526
create_clock [get_ports {CK}] -name CK -period 260.0 -waveform {0.0 130.0}
set_input_transition -min 2.6  [get_ports {CK}]
set_input_transition -max 13  [get_ports {CK}]
set_input_transition -min 2.6  [get_ports {G0}]
set_input_transition -max 13  [get_ports {G0}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G0}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G0}]
set_input_transition -min 2.6  [get_ports {G1}]
set_input_transition -max 13  [get_ports {G1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G1}]
set_input_transition -min 2.6  [get_ports {G2}]
set_input_transition -max 13  [get_ports {G2}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G2}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G2}]
set_input_transition -min 2.6  [get_ports {GND}]
set_input_transition -max 13  [get_ports {GND}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {GND}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {GND}]
set_input_transition -min 2.6  [get_ports {VDD}]
set_input_transition -max 13  [get_ports {VDD}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {VDD}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {VDD}]
set_max_transition 2.6  [get_ports {G147}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G147}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G147}]
set_max_transition 2.6  [get_ports {G148}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G148}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G148}]
set_max_transition 2.6  [get_ports {G198}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G198}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G198}]
set_max_transition 2.6  [get_ports {G199}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G199}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G199}]
set_max_transition 2.6  [get_ports {G213}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G213}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G213}]
set_max_transition 2.6  [get_ports {G214}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G214}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G214}]
