###############################################################
#  Generated by:      gen_sdc.py
#  Generated on:      Mon Jul 21 15:22:59 2025
#  Design:            s953
###############################################################
current_design s953
create_clock [get_ports {CK}] -name CK -period 260.0 -waveform {0.0 130.0}
set_input_transition -min 2.6  [get_ports {CK}]
set_input_transition -max 13  [get_ports {CK}]
set_input_transition -min 2.6  [get_ports {FullIIHS1}]
set_input_transition -max 13  [get_ports {FullIIHS1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {FullIIHS1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {FullIIHS1}]
set_input_transition -min 2.6  [get_ports {FullOHS1}]
set_input_transition -max 13  [get_ports {FullOHS1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {FullOHS1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {FullOHS1}]
set_input_transition -min 2.6  [get_ports {GND}]
set_input_transition -max 13  [get_ports {GND}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {GND}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {GND}]
set_input_transition -min 2.6  [get_ports {IInDoneHS1}]
set_input_transition -max 13  [get_ports {IInDoneHS1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {IInDoneHS1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {IInDoneHS1}]
set_input_transition -min 2.6  [get_ports {OutAvHS1}]
set_input_transition -max 13  [get_ports {OutAvHS1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {OutAvHS1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {OutAvHS1}]
set_input_transition -min 2.6  [get_ports {OutputHS1}]
set_input_transition -max 13  [get_ports {OutputHS1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {OutputHS1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {OutputHS1}]
set_input_transition -min 2.6  [get_ports {Prog_0}]
set_input_transition -max 13  [get_ports {Prog_0}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {Prog_0}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {Prog_0}]
set_input_transition -min 2.6  [get_ports {Prog_1}]
set_input_transition -max 13  [get_ports {Prog_1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {Prog_1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {Prog_1}]
set_input_transition -min 2.6  [get_ports {Prog_2}]
set_input_transition -max 13  [get_ports {Prog_2}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {Prog_2}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {Prog_2}]
set_input_transition -min 2.6  [get_ports {Rdy1BmHS1}]
set_input_transition -max 13  [get_ports {Rdy1BmHS1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {Rdy1BmHS1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {Rdy1BmHS1}]
set_input_transition -min 2.6  [get_ports {Rdy1RtHS1}]
set_input_transition -max 13  [get_ports {Rdy1RtHS1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {Rdy1RtHS1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {Rdy1RtHS1}]
set_input_transition -min 2.6  [get_ports {Rdy2BmHS1}]
set_input_transition -max 13  [get_ports {Rdy2BmHS1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {Rdy2BmHS1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {Rdy2BmHS1}]
set_input_transition -min 2.6  [get_ports {Rdy2RtHS1}]
set_input_transition -max 13  [get_ports {Rdy2RtHS1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {Rdy2RtHS1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {Rdy2RtHS1}]
set_input_transition -min 2.6  [get_ports {RtTSHS1}]
set_input_transition -max 13  [get_ports {RtTSHS1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {RtTSHS1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {RtTSHS1}]
set_input_transition -min 2.6  [get_ports {TpArrayHS1}]
set_input_transition -max 13  [get_ports {TpArrayHS1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {TpArrayHS1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {TpArrayHS1}]
set_input_transition -min 2.6  [get_ports {VDD}]
set_input_transition -max 13  [get_ports {VDD}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {VDD}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {VDD}]
set_input_transition -min 2.6  [get_ports {WantBmHS1}]
set_input_transition -max 13  [get_ports {WantBmHS1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {WantBmHS1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {WantBmHS1}]
set_input_transition -min 2.6  [get_ports {WantRtHS1}]
set_input_transition -max 13  [get_ports {WantRtHS1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {WantRtHS1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {WantRtHS1}]
set_max_transition 2.6  [get_ports {ActBmHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {ActBmHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {ActBmHS1}]
set_max_transition 2.6  [get_ports {ActRtHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {ActRtHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {ActRtHS1}]
set_max_transition 2.6  [get_ports {DumpIIHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {DumpIIHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {DumpIIHS1}]
set_max_transition 2.6  [get_ports {GoBmHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {GoBmHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {GoBmHS1}]
set_max_transition 2.6  [get_ports {GoRtHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {GoRtHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {GoRtHS1}]
set_max_transition 2.6  [get_ports {LdProgHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {LdProgHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {LdProgHS1}]
set_max_transition 2.6  [get_ports {LoadIIHHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {LoadIIHHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {LoadIIHHS1}]
set_max_transition 2.6  [get_ports {LoadOHHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {LoadOHHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {LoadOHHS1}]
set_max_transition 2.6  [get_ports {LxHIInHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {LxHIInHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {LxHIInHS1}]
set_max_transition 2.6  [get_ports {Mode0HS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {Mode0HS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {Mode0HS1}]
set_max_transition 2.6  [get_ports {Mode1HS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {Mode1HS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {Mode1HS1}]
set_max_transition 2.6  [get_ports {Mode2HS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {Mode2HS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {Mode2HS1}]
set_max_transition 2.6  [get_ports {NewLineHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {NewLineHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {NewLineHS1}]
set_max_transition 2.6  [get_ports {NewTrHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {NewTrHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {NewTrHS1}]
set_max_transition 2.6  [get_ports {ReRtTSHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {ReRtTSHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {ReRtTSHS1}]
set_max_transition 2.6  [get_ports {ReWhBufHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {ReWhBufHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {ReWhBufHS1}]
set_max_transition 2.6  [get_ports {SeFullIIHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {SeFullIIHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {SeFullIIHS1}]
set_max_transition 2.6  [get_ports {SeFullOHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {SeFullOHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {SeFullOHS1}]
set_max_transition 2.6  [get_ports {SeOutAvHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {SeOutAvHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {SeOutAvHS1}]
set_max_transition 2.6  [get_ports {ShftIIRHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {ShftIIRHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {ShftIIRHS1}]
set_max_transition 2.6  [get_ports {ShftORHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {ShftORHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {ShftORHS1}]
set_max_transition 2.6  [get_ports {TgWhBufHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {TgWhBufHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {TgWhBufHS1}]
set_max_transition 2.6  [get_ports {TxHIInHS1}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {TxHIInHS1}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {TxHIInHS1}]
