###############################################################
#  Generated by:      gen_sdc.py
#  Generated on:      Mon Jul 21 15:23:30 2025
#  Design:            s1423
###############################################################
current_design s1423
create_clock [get_ports {CK}] -name CK -period 260.0 -waveform {0.0 130.0}
set_input_transition -min 2.6  [get_ports {CK}]
set_input_transition -max 13  [get_ports {CK}]
set_input_transition -min 2.6  [get_ports {G0}]
set_input_transition -max 13  [get_ports {G0}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G0}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G0}]
set_input_transition -min 2.6  [get_ports {G1}]
set_input_transition -max 13  [get_ports {G1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G1}]
set_input_transition -min 2.6  [get_ports {G10}]
set_input_transition -max 13  [get_ports {G10}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G10}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G10}]
set_input_transition -min 2.6  [get_ports {G11}]
set_input_transition -max 13  [get_ports {G11}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G11}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G11}]
set_input_transition -min 2.6  [get_ports {G12}]
set_input_transition -max 13  [get_ports {G12}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G12}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G12}]
set_input_transition -min 2.6  [get_ports {G13}]
set_input_transition -max 13  [get_ports {G13}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G13}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G13}]
set_input_transition -min 2.6  [get_ports {G14}]
set_input_transition -max 13  [get_ports {G14}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G14}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G14}]
set_input_transition -min 2.6  [get_ports {G15}]
set_input_transition -max 13  [get_ports {G15}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G15}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G15}]
set_input_transition -min 2.6  [get_ports {G16}]
set_input_transition -max 13  [get_ports {G16}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G16}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G16}]
set_input_transition -min 2.6  [get_ports {G2}]
set_input_transition -max 13  [get_ports {G2}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G2}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G2}]
set_input_transition -min 2.6  [get_ports {G3}]
set_input_transition -max 13  [get_ports {G3}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G3}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G3}]
set_input_transition -min 2.6  [get_ports {G4}]
set_input_transition -max 13  [get_ports {G4}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G4}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G4}]
set_input_transition -min 2.6  [get_ports {G5}]
set_input_transition -max 13  [get_ports {G5}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G5}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G5}]
set_input_transition -min 2.6  [get_ports {G6}]
set_input_transition -max 13  [get_ports {G6}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G6}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G6}]
set_input_transition -min 2.6  [get_ports {G7}]
set_input_transition -max 13  [get_ports {G7}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G7}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G7}]
set_input_transition -min 2.6  [get_ports {G8}]
set_input_transition -max 13  [get_ports {G8}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G8}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G8}]
set_input_transition -min 2.6  [get_ports {G9}]
set_input_transition -max 13  [get_ports {G9}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G9}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G9}]
set_input_transition -min 2.6  [get_ports {GND}]
set_input_transition -max 13  [get_ports {GND}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {GND}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {GND}]
set_input_transition -min 2.6  [get_ports {VDD}]
set_input_transition -max 13  [get_ports {VDD}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {VDD}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {VDD}]
set_max_transition 2.6  [get_ports {G701BF}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G701BF}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G701BF}]
set_max_transition 2.6  [get_ports {G702}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G702}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G702}]
set_max_transition 2.6  [get_ports {G726}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G726}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G726}]
set_max_transition 2.6  [get_ports {G727}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G727}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G727}]
set_max_transition 2.6  [get_ports {G729}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G729}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G729}]
