###############################################################
#  Generated by:      gen_sdc.py
#  Generated on:      Mon Jul 21 15:21:56 2025
#  Design:            s444
###############################################################
current_design s444
create_clock [get_ports {CK}] -name CK -period 260.0 -waveform {0.0 130.0}
set_input_transition -min 2.6  [get_ports {CK}]
set_input_transition -max 13  [get_ports {CK}]
set_input_transition -min 2.6  [get_ports {G0}]
set_input_transition -max 13  [get_ports {G0}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G0}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G0}]
set_input_transition -min 2.6  [get_ports {G1}]
set_input_transition -max 13  [get_ports {G1}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G1}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G1}]
set_input_transition -min 2.6  [get_ports {G2}]
set_input_transition -max 13  [get_ports {G2}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G2}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G2}]
set_input_transition -min 2.6  [get_ports {GND}]
set_input_transition -max 13  [get_ports {GND}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {GND}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {GND}]
set_input_transition -min 2.6  [get_ports {VDD}]
set_input_transition -max 13  [get_ports {VDD}]
set_input_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {VDD}]
set_input_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {VDD}]
set_max_transition 2.6  [get_ports {G107}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G107}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G107}]
set_max_transition 2.6  [get_ports {G108}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G108}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G108}]
set_max_transition 2.6  [get_ports {G118}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G118}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G118}]
set_max_transition 2.6  [get_ports {G119}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G119}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G119}]
set_max_transition 2.6  [get_ports {G167}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G167}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G167}]
set_max_transition 2.6  [get_ports {G168}]
set_output_delay -add_delay 13 -min -clock [get_clocks {CK}] [get_ports {G168}]
set_output_delay -add_delay 26 -max -clock [get_clocks {CK}] [get_ports {G168}]
